lkolbly/cmsis-svd/data/TexasInstruments/LM3S2965.svd
        <register>
          <name>IF2ARB1</name>
          <description>CAN IF2 Arbitration 1</description>
          <addressOffset>0x00000090</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2ARB1_ID</name>
              <description>Message Identifier</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2ARB2</name>
          <description>CAN IF2 Arbitration 2</description>
          <addressOffset>0x00000094</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2ARB2_ID</name>
              <description>Message Identifier</description>
              <bitRange>[12:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF2ARB2_DIR</name>
              <description>Message Direction</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CAN_IF2ARB2_XTD</name>
              <description>Extended Identifier</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CAN_IF2ARB2_MSGVAL</name>
              <description>Message Valid</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2MCTL</name>
          <description>CAN IF2 Message Control</description>
          <addressOffset>0x00000098</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2MCTL_DLC</name>
              <description>Data Length Code</description>
              <bitRange>[3:0]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_EOB</name>
              <description>End of Buffer</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_TXRQST</name>
              <description>Transmit Request</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_RMTEN</name>
              <description>Remote Enable</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_RXIE</name>
              <description>Receive Interrupt Enable</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_TXIE</name>
              <description>Transmit Interrupt Enable</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_UMASK</name>
              <description>Use Acceptance Mask</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_INTPND</name>
              <description>Interrupt Pending</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_MSGLST</name>
              <description>Message Lost</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>CAN_IF2MCTL_NEWDAT</name>
              <description>New Data</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DA1</name>
          <description>CAN IF2 Data A1</description>
          <addressOffset>0x0000009C</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2DA1_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DA2</name>
          <description>CAN IF2 Data A2</description>
          <addressOffset>0x000000A0</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2DA2_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DB1</name>
          <description>CAN IF2 Data B1</description>
          <addressOffset>0x000000A4</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2DB1_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>IF2DB2</name>
          <description>CAN IF2 Data B2</description>
          <addressOffset>0x000000A8</addressOffset>
          <fields>
            <field>
              <name>CAN_IF2DB2_DATA</name>
              <description>Data</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ1</name>
          <description>CAN Transmission Request 1</description>
          <addressOffset>0x00000100</addressOffset>
          <fields>
            <field>
              <name>CAN_TXRQ1_TXRQST</name>
              <description>Transmission Request Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TXRQ2</name>
          <description>CAN Transmission Request 2</description>
          <addressOffset>0x00000104</addressOffset>
          <fields>
            <field>
              <name>CAN_TXRQ2_TXRQST</name>
              <description>Transmission Request Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NWDA1</name>
          <description>CAN New Data 1</description>
          <addressOffset>0x00000120</addressOffset>
          <fields>
            <field>
              <name>CAN_NWDA1_NEWDAT</name>
              <description>New Data Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>NWDA2</name>
          <description>CAN New Data 2</description>
          <addressOffset>0x00000124</addressOffset>
          <fields>
            <field>
              <name>CAN_NWDA2_NEWDAT</name>
              <description>New Data Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG1INT</name>
          <description>CAN Message 1 Interrupt Pending</description>
          <addressOffset>0x00000140</addressOffset>
          <fields>
            <field>
              <name>CAN_MSG1INT_INTPND</name>
              <description>Interrupt Pending Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG2INT</name>
          <description>CAN Message 2 Interrupt Pending</description>
          <addressOffset>0x00000144</addressOffset>
          <fields>
            <field>
              <name>CAN_MSG2INT_INTPND</name>
              <description>Interrupt Pending Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG1VAL</name>
          <description>CAN Message 1 Valid</description>
          <addressOffset>0x00000160</addressOffset>
          <fields>
            <field>
              <name>CAN_MSG1VAL_MSGVAL</name>
              <description>Message Valid Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>MSG2VAL</name>
          <description>CAN Message 2 Valid</description>
          <addressOffset>0x00000164</addressOffset>
          <fields>
            <field>
              <name>CAN_MSG2VAL_MSGVAL</name>
              <description>Message Valid Bits</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
